//------------------------------------------------------------------------------------------
// 2023. 2학기 C++ 9월 28일 월요일                         월56목34      (4주 2일)
//------------------------------------------------------------------------------------------
// sort - bubble sort
//------------------------------------------------------------------------------------------
// [과제] 정렬 관련 내용을 구글에서 찾아보기
//------------------------------------------------------------------------------------------

#include <iostream>

using namespace std;

void change(int &, int &); // 함수 선언문

int main() {
    int a[]{10, 8, 6, 4, 2, 9, 7, 5, 3, 1};
    // [문제] a를 오름차순(ascending order)으로 정렬하라.
    for (int j = 0; j < sizeof(a) / sizeof(int) - 1; j++) {
        for (int i = 0; i < sizeof(a) / sizeof(int) - j - 1; i++) {
            if (a[i] > a[i + 1]) {
                change(a[i], a[i + 1]);
            }
        }
    }

    // a array 출력
    for (int num: a) {
        cout << num << ' ';
    }
    cout << endl;

}

void change(int &a, int &b) { // function definition 함수 정의
    int t{a};
    a = b;
    b = t;
}