//------------------------------------------------------------------------------------------
// 2023. 2학기 C++ 9월 28일 월요일                         월56목34      (4주 2일)
//------------------------------------------------------------------------------------------
// sort - qsort
//------------------------------------------------------------------------------------------
// [과제] 정렬 관련 내용을 구글에서 찾아보기
//------------------------------------------------------------------------------------------

#include <iostream>
#include <random>
#include <cstdlib>

using namespace std;

default_random_engine dre;
uniform_int_distribution uid{1, 99'9999};

int big_sort(const void *, const void *);

int main() {
    // [문제] 랜덤값을 갖는 int 100만개를 생성하라.
    // 100만개의 int를 오름차순으로 정렬하라.
    // 정렬한 int 중 앞에서 10개를 출력하라.
    // 정렬한 int 중 뒤에서 10개를 출력하라.

    // 내코드 ---------------------------------------------------


    int a[100'0000];

    for (int i = 0; i < 100'0000; i++) {
        a[i] = uid(dre);
    }

    qsort(a, 100'0000, 4, big_sort);

    for (int i = 0; i < 10; i++) {
        cout << a[i] << " ";
    }
    cout << '\n';

    for (int i = 10; i < 0; i++) {
        cout << a[100'0000 - i] << " ";
    }

}

int big_sort(const void *a, const void *b) {
    int *p = (int *) a;
    int *q = (int *) b;

    if (*p > *q)
        return 1;
    else if (*p < *q)
        return -1;

    return 0;
}