//------------------------------------------------------------------------------------------
// 2023. 2학기 C++ 9월 11일 월요일                         월56목34      (2주 1일)
//------------------------------------------------------------------------------------------
// int n; 의 의미 - sizeOf, addressOf, typeId(id).name()
//------------------------------------------------------------------------------------------
// [과제] 공부한 내용 반복 해서 실행 가능 하도록 하자
//------------------------------------------------------------------------------------------

#include <iostream>  // -> 토큰 5개 (컴퓨터가 나눠서 인식하는거)  #, include, <, iostream, >
#include "save.h"

using namespace std;

int main() {
    // identifier 식별자.. int -> 식별자 n -> 식별자 (식별자 두개가 합쳐짐) (토큰 2개)
    // data type - identifier
    // int 형, 즉 정수형 메모리를 이 만큼 주세요. (int에 정해진 메모리가 있을꺼임)
    // 지정해준 int형 메모리, 즉, 데이터 타입을 n이라는 이름으로 선언
    // n 에 대해서 3가지 요청을 지원함
    /*
     * 1. sizeOf (n); (n에 할당된 주소의 크기)
     * 2. addressOf (n); (n에 할당된 데이터 타입)
     * 3. typeid (n).name; (이건 뭐누?)
     */

    int n;


}
