//------------------------------------------------------------------------------------------
// 2023. 2학기 C++ 10월 5일 목요일                         월56목34      (5주 2일)
//------------------------------------------------------------------------------------------
// sort - qsort
//------------------------------------------------------------------------------------------
// [과제] 정렬 관련 내용을 구글에서 찾아보기
//------------------------------------------------------------------------------------------

#include <iostream>

using namespace std;

// [문제] 사용자에게 원하는 수 num을 입력받아 int가 num개 저장될 공간을 확보한다.
// int값을 1부터 시작하는 수로 채워라.
// 합계를 화면에 출력하라
// 이과정을 영원히 반복하시오.
int main() {
//    int num;
//    while (true) {
//        cout << "원하는 수를 입력하세요:";
//        cin >> num;
//        int *array = new int[num];
//        for (int i = 0; i < num; i++) {
//            array[i] = i + 1;
//        }
//        int *sum = new int{0};
//        for (int i = 0; i < num; i++) {
//            *sum = *sum + array[i];
//        }
//        cout << *sum << endl;
//        delete sum;
//        delete array;
//    }

    // 교수님 코드
    while (true) {
        cout << "숫자를 입력하세요 - ";
        int num;
        cin >> num;

        int *p;
        p = new int[num]; // 메모리가 없다면? - exception

        for (int i = 0; i < num; ++i) {
            p[i] = i + 1;
        }

        // 합계를 구함
        int sum{};
        for (int i = 0; i < num; ++i) {
            sum += p[i];
        }

        cout << "1부터 " << num << "까지 합계 = " << sum << endl;

        delete p;
    }
}
